{
    "projectConfig": {
        "labelCountry": "Country",
        "labelCity": "City",
        "labelAge": "Age",
        "labelReturn": "Home",
        "labelTabs": {
            "about": "About me",
            "skills": "Skills",
            "projetcs": "Projects"
        },
        "labelButton": "Go to project",
        "labelSeeMore": "See more",
        "footerLabel": "© 2023 All rights reserved."
    },
    "userConfig": {
        "username": "Wendell Cassio",
        "position": "Front-end Developer",
        "age": "36",
        "location": {
            "country": "Brasil",
            "city": "Belo Horizonte"
        },
        "languages": [
            {
                "language": "Portuguese",
                "value": "85",
                "locale": "br"
            },
            {
                "language": "English",
                "value": "55",
                "locale": "en"
            },
            {
                "language": "Spanish",
                "value": "75",
                "locale": "es"
            }
        ],
        "initialMessage": "Hi, Welcome!!",
        "description": "I enjoy creating front-end products with great user experiences."
    },
    "about": {
        "title": "Hi, I'm Wendell Cassio!",
        "description": "Born in Belo Horizonte - MG, passionate about technology and playing sports like football. Graduated in Systems Analysis and Development at UniBH, I have been working with web development for over 12 years. My focus is to develop web products that provide user experiences.",
        "image": {
            "src": "/assets/images/sobre.jpg",
            "alt": "Decoration image"
        }
    },
    "skills": [
        {
            "id": 1,
            "skillName": "html5",
            "skillValue": "85",
            "description": "HTML5 is a markup language used for structuring and presenting content on the World Wide Web. It is the fifth and final major HTML version that is a World Wide Web Consortium (W3C) recommendation. The current specification is known as the HTML Living Standard. It is maintained by the Web Hypertext Application Technology Working Group (WHATWG), a consortium of the major browser vendors (Apple, Google, Mozilla, and Microsoft).HTML5 was first released in a public-facing form on 22 January 2008, with a major update and 'W3C Recommendation' status in October 2014. Its goals were to improve the language with support for the latest multimedia and other new features; to keep the language both easily readable by humans and consistently understood by computers and devices such as web browsers, parsers, etc., without XHTML's rigidity; and to remain backward-compatible with older software. HTML5 is intended to subsume not only HTML 4 but also XHTML 1 and DOM Level 2 HTML.HTML5 includes detailed processing models to encourage more interoperable implementations; it extends, improves, and rationalizes the markup available for documents and introduces markup and application programming interfaces (APIs) for complex web applications. For the same reasons, HTML5 is also a candidate for cross-platform mobile applications because it includes features designed with low-powered devices in mind.",
            "logo": "/assets/images/logos/html5.svg",
            "link": "https://en.wikipedia.org/wiki/html5"
        },
        {
            "id": 2,
            "skillName": "css3",
            "skillValue": "85",
            "description": "Unlike CSS 2, which is a large single specification defining various features, CSS 3 is divided into several separate documents called 'modules'. Each module adds new capabilities or extends features defined in CSS 2, preserving backward compatibility. Work on CSS level 3 started around the time of publication of the original CSS 2 recommendation. The earliest CSS 3 drafts were published in June 1999.Due to the modularization, different modules have different stability and statuses.",
            "logo": "/assets/images/logos/css3.svg",
            "link": "https://en.wikipedia.org/wiki/css3"
        },
        {
            "id": 3,
            "skillName": "javascript",
            "skillValue": "85",
            "description": "JavaScript, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard. It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM).The ECMAScript standard does not include any input/output (I/O), such as networking, storage, or graphics facilities. In practice, the web browser or other runtime system provides JavaScript APIs for I/O.JavaScript engines were originally used only in web browsers, but are now core components of some servers and a variety of applications. The most popular runtime system for this usage is Node.js.",
            "logo": "/assets/images/logos/javascript.svg",
            "link": "https://en.wikipedia.org/wiki/javascript"
        },
        {
            "id": 4,
            "skillName": "angular",
            "skillValue": "65",
            "description": "Angular (commonly referred to as 'Angular 2+' or 'Angular 2') is an open-source, front-end, TypeScript-based web application platform led by the Angular Team at Google and a community of individuals and corporations. Angular is a complete rewrite of AngularJS, made by the same team that built it.",
            "logo": "/assets/images/logos/angular.svg",
            "link": "https://en.wikipedia.org/wiki/angular"
        },
        {
            "id": 5,
            "skillName": "wordpress",
            "skillValue": "75",
            "description": "WordPress (WP or WordPress.org) is a free and open-source content management system (CMS) written in hypertext preprocessor language and paired with a MySQL or MariaDB database with supported HTTPS. Features include a plugin architecture and a template system, referred to within WordPress as 'Themes'. WordPress was originally created as a blog-publishing system but has evolved to support other web content types including more traditional mailing lists and Internet fora, media galleries, membership sites, learning management systems (LMS) and online stores. One of the most popular content management system solutions in use, WordPress is used by 42.8% of the top 10 million websites as of October 2021",
            "logo": "/assets/images/logos/wordpress.png",
            "link": "https://en.wikipedia.org/wiki/wordpress"
        },
        {
            "id": 6,
            "skillName": "php",
            "skillValue": "55",
            "description": "PHP is a general-purpose scripting language geared toward web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993 and released in 1995. The PHP reference implementation is now produced by The PHP Group. PHP was originally an abbreviation of Personal Home Page, but it now stands for the recursive initialism PHP: Hypertext Preprocessor. PHP code is usually processed on a web server by a PHP interpreter implemented as a module, a daemon or as a Common Gateway Interface (CGI) executable. On a web server, the result of the interpreted and executed PHP code – which may be any type of data, such as generated HTML or binary image data – would form the whole or part of an HTTP response. Various web template systems, web content management systems, and web frameworks exist which can be employed to orchestrate or facilitate the generation of that response. Additionally, PHP can be used for many programming tasks outside the web context, such as standalone graphical applications and robotic drone control. PHP code can also be directly executed from the command line.",
            "logo": "/assets/images/logos/php.svg",
            "link": "https://en.wikipedia.org/wiki/php"
        },
        {
            "id": 7,
            "skillName": "node",
            "skillValue": "55",
            "description": "Node.js is a cross-platform, open-source server environment that can run on Windows, Linux, Unix, macOS, and more. Node.js is a back-end JavaScript runtime environment, runs on the V8 JavaScript Engine, and executes JavaScript code outside a web browser.Node.js lets developers use JavaScript to write command line tools and for server-side scripting. The functionality of running scripts server-side produces dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js represents a 'JavaScript everywhere' paradigm,unifying web-application development around a single programming language, rather than different languages for server-side and client-side scripts.Node.js has an event-driven architecture capable of asynchronous I/O. These design choices aim to optimize throughput and scalability in web applications with many input/output operations, as well as for real-time Web applications (e.g., real-time communication programs and browser games)",
            "logo": "/assets/images/logos/node.svg",
            "link": "https://en.wikipedia.org/wiki/Node.js"
        },
        {
            "id": 8,
            "skillName": "git",
            "skillValue": "55",
            "description": "Git is a distributed version control system: tracking changes in any set of files, usually used for coordinating work among programmers collaboratively developing source code during software development. Its goals include speed, data integrity, and support for distributed, non-linear workflows (thousands of parallel branches running on different systems).Git was originally authored by Linus Torvalds in 2005 for development of the Linux kernel, with other kernel developers contributing to its initial development. Since 2005, Junio Hamano has been the core maintainer. As with most other distributed version control systems, and unlike most client–server systems, every Git directory on every computer is a full-fledged repository with complete history and full version-tracking abilities, independent of network access or a central server. Git is free and open-source software distributed under the GPL-2.0-only license.",
            "logo": "/assets/images/logos/git.svg",
            "link": "https://en.wikipedia.org/wiki/Git"
        }
    ],
    "projects": [
        {
            "name": "Banco BS2",
            "description": "Web portal developed to meet the needs and financial transactions of bank customers. Based on Angular version 12 and Angular Material, with its own Design System.",
            "link": "https://www.bancobs2.com.br/"
        },
        {
            "name": "Versiani Consulting",
            "description": "Versini was created to support companies to achieve their sustainable development goals defined by the United Nations. Website developed in Wordpress, translated into 3 languages.",
            "link": "https://versianiconsulting.com/"
        },
        {
            "name": "Montebelo Condomínio Park",
            "description": "It is a condominium of apartments focused on indoor comfort, with natural lighting and ventilation in all rooms. Website developed in Wordpress with all content manageable.",
            "link": "https://montebelosantaluzia.com.br/"
        },
        {
            "name": "Construtora MRV",
            "description": "MRV is the largest construction company in Latin America. The extensive experience allows the planning of the construction process, generating the best cost-benefit ratio on the market.",
            "link": "https://www.mrv.com.br/"
        },
        {
            "name": "Construtora Caparaó",
            "description": "Caparaó consolidated its brand among the main real estate builders in Brazil by combining innovation, care in execution and technology with a differentiated service.",
            "link": "https://caparao.com.br/"
        }
    ]
}
